{
  "title": "Documents KYC",
  "description": "La procédure KYC (Know Your Customer) permet de vérifier votre identité conformément aux réglementations en vigueur.",
  "loading": "Chargement du statut KYC...",
  "status": {
    "required": {
      "label": "Documents requis",
      "description": "OVHcloud a besoin de vérifier votre identité. Veuillez soumettre les documents demandés."
    },
    "pending": {
      "label": "En cours de vérification",
      "description": "Vos documents ont été reçus et sont en cours d'examen par nos équipes."
    },
    "open": {
      "label": "Procédure en cours",
      "description": "Une procédure de vérification est en cours sur votre compte."
    },
    "closed": {
      "label": "Vérifié",
      "description": "Votre identité a été vérifiée avec succès."
    },
    "none": {
      "label": "Aucune procédure",
      "description": "Aucune vérification de documents n'est requise pour le moment."
    }
  },
  "upload": {
    "startButton": "Soumettre mes documents",
    "selectTitle": "Sélectionnez vos documents",
    "dropZone": "Glissez-déposez vos fichiers ici ou cliquez pour sélectionner",
    "formats": "Formats acceptés : JPG, PNG, PDF (max 10 Mo par fichier)",
    "submitButton": "Envoyer les documents",
    "uploading": "Envoi en cours...",
    "successTitle": "Documents envoyés !",
    "successMessage": "Vos documents ont été transmis. Le délai de traitement est généralement de 2 à 5 jours ouvrés. Vous serez notifié par email.",
    "errors": {
      "noLink": "Erreur : lien d'upload non disponible",
      "generic": "Une erreur est survenue lors de l'envoi"
    }
  },
  "pending": {
    "processingTime": "Le délai de traitement est généralement de 2 à 5 jours ouvrés. Vous serez notifié par email une fois la vérification terminée."
  },
  "none": {
    "futureNotice": "Si une vérification est requise à l'avenir, vous en serez informé par email."
  },
  "info": {
    "title": "À propos de la vérification KYC",
    "description": "La vérification de votre identité nous permet de sécuriser votre compte et de respecter les réglementations anti-fraude. Vos documents sont traités de manière confidentielle et sécurisée.",
    "privacyLink": "Consulter notre politique de confidentialité →"
  }
}
